app/controllers/listings_controller.rb

  def index
    #@listings = Listing.all.order("created_at DESC")

    @listings = Listing.all
---
SELECT "listings".* FROM "listings" WHERE (LOWER(name) LIKE '%hand-knitted scarf%' OR LOWER(description) LIKE '%hand-knitted scarf%')  ORDER BY created_at DESC

  def seller
    @listings = Listing.where(user: current_user).order("created_at DESC")
---
SELECT "listings".* FROM "listings" WHERE "listings"."user_id" = 7  ORDER BY created_at DESC

  def create
    @listing = Listing.new(listing_params)
    @listing.user_id = current_user.id
    respond_to do |format|
      if @listing.save
---
INSERT INTO "listings" ("name", "description", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "car"], ["description", "this is an audi"], ["price", 1000.0], ["created_at", "2016-05-07 02:55:11.153707"], ["updated_at", "2016-05-07 02:55:11.153707"]]

  def update
    respond_to do |format|
      if @listing.update(listing_params)
---
UPDATE "listings" SET "description" = ?, "updated_at" = ? WHERE "listings"."id" = ?  [["description", "this is an audi a9"], ["updated_at", "2016-05-07 02:56:18.988407"], ["id", 1]]

  def destroy
    @listing.destroy
---
DELETE FROM "listings" WHERE "listings"."id" = ?  [["id", 6]]

    def set_listing
      @listing = Listing.find(params[:id])
---
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT 1  [["id", 6]]