app/controllers/pages_controller.rb

SELECT "listings".* FROM "listings" WHERE (name LIKE '%a%' OR description LIKE '%a%')  ORDER BY created_at DESC
---
  def new_arrivals
  	 @listings = Listing.all

SELECT "listings".* FROM "listings"  ORDER BY name DESC
---
  def browse
    @listings = Listing.all